Autodesk.Revit.DB.ExportPatternInfo.DestinationPatternName
The destination pattern name (the name of the pattern in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportPatternInfo.#ctor(System.String)
Constructs a new ExportPatternInfo using the destination pattern name as input.
destinationPatternName:
The destination pattern name (the name of the pattern in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportPatternInfo.#ctor(Autodesk.Revit.DB.ExportPatternInfo)
Constructs a new copy of the input ExportPatternInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014